import asyncio

import pymorphy2
from aiogram import Bot, Dispatcher, types
from aiogram.contrib.fsm_storage.redis import RedisStorage2

from data import config
from utils.my_classes import BidirectionalDict

bot = Bot(token=config.BOT_TOKEN, parse_mode=types.ParseMode.HTML)
storage = RedisStorage2(pool_size=100, db=2)
dp = Dispatcher(bot, storage=storage)
loop = asyncio.get_event_loop()

admins = [698281804]

name_of_bot = "Модер"
prefixes = fr"([+!]|{name_of_bot}[. ,!;]+)?"


username_of_bot = "chat_manager_val_bot"
link_to_bot = "https://t.me/" + username_of_bot
exceptions_chat_id = 100 #chat id

morph = pymorphy2.MorphAnalyzer()
interval_dict = {"хвилина" : "minute", "година" : "hour", "день" : "day", "тиждень" : "week", "місяць" : "month", "рік" : "year"}
interval_available = "(хвилина|хвилини|хвилин|година|години|годин|день|дні|днів|тиждень|тижні|тижнів|місяць|місяці|місяців|рік|роки|років)"

filepath = r"path_to_project/files/"

max_len_text = 65400

ranks_normal_dict = {
    0:"учасник",
    1:"молодший адмін",
    2:"середній адмін",
    3:"старший адмін",
    4:"власник"}

ranks = BidirectionalDict({
    0: "учасник",
    1: "молодший адмін",
    2: "середній адмін",
    3: "старший адмін",
    4: "власник"})


commands_normal_dict = {
1 : "правила",
2 : "вітання",
3 : "варн",
4 : "бан",
5 : "кік",
6 : "амністія",
7 : "бан лист",
8 : "нагородити",
9 : "виклик нагород",
10 : "зняття наград",
11 : "кік новачків",
12 : "кік від",
13 : "розбан",
14 : "варн ліміт",
15 : "варн лист",
16 : "налаштування",
17 : "список команд",
18 : "покликати всіх",
1000 : "установка доступу команд",
}


commands_id = BidirectionalDict(
{
1 : "правила",
2 : "вітання",
3 : "варн",
4 : "бан",
5 : "кік",
6 : "амністія",
7 : "бан лист",
8 : "нагородити",
9 : "виклик нагород",
10 : "зняття наград",
11 : "кік новачків",
12 : "кік від",
13 : "розбан",
14 : "варн ліміт",
15 : "варн лист",
16 : "налаштування",
17 : "список команд",
18 : "покликати всіх",
1000 : "установка доступу команд",
})

rewards_id = BidirectionalDict({
    1 : "🎗",
    2 : "🥉",
    3 : "🥈",
    4 : "🥇",
    5 : "🎖",
    6 : "🏅",
    7 : "🏆",
})

commands_dict = {
    1: 'Встановлення доступу до команд. Встановлює ранг адміна, який потрібен для використання команди.\nЩоб переглянути список назв команд, введіть "список команд"\nШаблон:\nдк {назва команди} {ранг}\n\nПриклад використання:\n\n1. дк бан 2\n2. дк розбан 3',
    2: 'Команда виводить список адміністраторів (у боті, не в телеграмі) в чаті\n\nПриклад використання:\n\n1. хто адмін',
    3: 'Допомагає встановити ранг учасника в чаті\nСписок рангів:\n0 - Учасник\n1 - Молодший адмін\n2 - Середній адмін\n3 - Старший адмін\n4 - Власник\nВласника можна передати за допомогою команди передати власника {юзернейм}\n\nШаблон:\nадмін {ранг} {юзернейм}\n\nПриклад використання:\n\n1. адмін 2 @durov',
    4: 'Передає власника іншому учаснику чату\nШаблон:\nпередати власника {юзернейм}\n\nПриклад використання:\n\n1. !передати власника @durov (префікс обов\'язковий)',
    5: 'Повертає власника, якщо його було передано раніше\nШаблон:\nповернути власника\n\nПриклад використання:\n\n1. !повернути власника',
    6: 'Встановлює правила чату, які учасники можуть переглянути, написавши "Правила" в групі\nШаблон:\nправила\n{текст}\n\nПриклад використання:\n\n1. Правила\nНе можна лаятися',
    7: 'Встановлює привітання чату, коли в групу заходять нові учасники, бот їх привітає. У тексті можна використовувати "{ім\'я}", і бот підставить ім\'я користувача замість змінної\nШаблон: привітання\n{текст}\n\nПриклад використання:\n\n1. привітання\nПривіт, {ім\'я}, раді тебе бачити',
    8: 'Дозволяє нагородити користувача або зняти з нього нагороди\nШаблон:\nнагородити {юзернейм} {опис} - нагороджує учасника\nнагороди {юзернейм} - переглянути список нагород\nзняти всі нагороди {юзернейм} - знімає всі нагороди з учасника\nзняти нагороду {номер} {юзернейм} - знімає конкретну нагороду\n\n\nПриклад використання:\n\n1. нагородити @durov крутий чувак',
    9: 'Налаштування бесіди, дозволяє налаштувати фільтр повідомлень\nШаблон:\n+Бесіди / -Бесіди — дозволяє/забороняє надсилати повідомлення з посиланнями на чати.\n+Сайти / -Сайти — дозволяє/забороняє надсилати посилання на сторонні сайти.\n+Боти / -Боти — дозволяє/забороняє додавати ботів у чат.\n+Канали / -Канали — дозволяє/забороняє надсилати посилання на сторонні канали.\n\nПриклад використання:\n\n1. +сайти',
    10: '''Варн {період} {посилання} — виставляється одне попередження користувачу на вказаний термін. На наступному рядку можна написати причину попередження.
Наприклад:
Варн @username Флуд
・Варни ліміт {число} — встановлює кількість попереджень, після яких користувача видаляють з чату (за замовчуванням 3).
・Варни {юзернейм} — список поточних попереджень користувача.
・Варнлист — список останніх попереджень у чаті (аналог банлиста).''',
    11: '''Бан {період} {посилання} — блокує користувача на заданий період часу. За замовчуванням блокує назавжди.
Наприклад:
Бан 1 місяць @username Спам
Зверніть увагу на особливості Telegram: при блокуванні більше ніж на 366 днів або менше ніж на 30 секунд, користувача блокують назавжди.
・Банлист — список банів у чаті
・Розбан {посилання} — знімає блокування з користувача. Після розблокування користувач зможе повернутися в чат за посиланням або його можуть додати інші учасники.
''',
    12: '''Кік {посилання} — видаляє користувача з чату без бана. У такому разі він зможе повернутися в чат за посиланням або його можуть додати інші учасники.
Кік актив — видаляє активних користувачів за певний час (не більше 10 хвилин). Функція корисна при рейдах.
Приклад: !кік актив 1 хвилина
Кік новачків
Кік новачків {період} — видаляє нових користувачів, які вперше з\'явилися в чаті за вказаний період. Функція корисна при рейдах. Приклад: Кік новачків 1 година
Кік від {посилання} — видаляє користувачів, яких запросив учасник
''',
    14: '''Показує інформацію про учасника\n\nПриклад використання:\n\n1. хто я''',
    15: '''Показує правила чату\n\nПриклад використання:\n\n1. правила''',
    16: '''Бот привітає учасника\n\nПриклад використання:\n\n1. Привітати @durov''',
    17: '''Дізнатися ймовірність чогось\n\nШаблон: ймовірність що {текст}\n\nПриклад використання:\n1. ймовірність що я гей''',
    18: '''Обирає випадкового учасника з бесіди\n\nШаблон: хто {текст}\n\nПриклад використання:\n\n1. хто гей''',
    19: '''Дозволяє встановити нік, після чого бот буде згадувати вас за допомогою вашого ніку\nОбмеження: 15 символів\n\nШаблон: нік {текст}\n\nПриклад використання:\n\n1. нік кішечка''',
    20: '''Напишіть у відповідь на повідомлення + або -, таким чином репутація учасника зміниться\n\nПриклад використання:\n\n1. + (У відповідь на повідомлення)''',
    21: '''Дозволяє переглянути найактивніших учасників у чаті\n\nШаблон: топ активних день/тиждень\n\nПриклад використання:\n\n1. топ активних день''',
    22: '''Дозволяє одружитися з кимось\nШаблон:\n
・одружитися {посилання} — відправить пропозицію про створення шлюбу.
・!Розлучення — розриває шлюб.\n\nПриклад використання:\n\n1. одружитися @durov''',
    23: '''Дозволяє переглянути свої нагороди або видалити їх\nШаблон:\n
・мої нагороди — показує список ваших нагород.
・зняти свою нагороду {номер} — знімає нагороду, номер знаходиться у квадратних дужках при виклику команди мої нагороди'''
}


